{"pageProps":{"postData":{"id":"national-fellowships","contentHtml":"<h2>The question</h2>\n<p>To get a faculty job you have to be able to demosntrate leadership and academic independence.\nSo you are a better candidate if you have done that in the past.\nIt's hard to do that as a grad student because it's hard to:\n1. get out of your advisor's shadow\n2. you don't have the resources\n3. don't have thet experience</p>\n<p>So that creates an industry of postdoctoral researchers that bounce around in ~3 year term-limited positions indefinitely until they either cross the magic threshold that makes them eligible to be a faculty (applying every year to dozens of jobs and usually getting brutally rejected) or they decide to leave the field.</p>\n<p>There are two kinds of traditional postdocs: 1) soft money and 2) fellowships.\nThe soft money postdocs are grant funded and supervised by a faculty member.\nThese positions are usually project-based and you get only some X% (where X is ~30) of time to work on your own interests.\nThey're common as first postdocs for a lot of folks.</p>\n<p>The fellowships though, give you 100% of your own time as well as addtional resources to carry out your research.\nThey're basically little faculty launchpads.\nThe wealthier institutions can afford to support more of these sorts of positions, offering multiple per year whereas smaller institutions can't afford even a single one.\nIn additional to these institutional fellowships, there are national fellowships that allow you to take the money anywhere in the US and bring your own funding.\nThere's an inherit incentive to concentrate national fellowship money at the wealthy institutions (rich get richer) and so there's a limit of one fellowship of each type (typically) per institution.</p>\n<p>So it begs the question, are the national fellowships actually benefitting less-wealthy institutions or are there enough prestigious institutions that the small number of fellows can find a spot there?</p>\n<h2>The Data</h2>\n<h3>acquiring the data</h3>\n<p>it's public lawl</p>\n<h3>cleaning the data</h3>\n<p>it was a bitch to clean</p>\n<h2>The answer</h2>\n<ul>\n<li>a nice map showing where people are</li>\n<li>bubble chart</li>\n<li>some d3 bar charts</li>\n<li>line chart showing evolution of fellows at top institutions over time</li>\n</ul>\n<h4></h4>\n<p>Title: Visualizing the Distribution of National Fellowships in Astronomy: A Look at Institutional Inequality</p>\n<p>Introduction:\nIn this blog post, I will discuss a data visualization project I undertook to examine the distribution of national fellowships in astronomy across different institutions. This analysis aims to understand whether these fellowships benefit less-wealthy institutions or if they further concentrate resources at prestigious institutions, perpetuating the \"rich get richer\" phenomenon.</p>\n<p>Section 1: The Challenges of Demonstrating Leadership and Academic Independence</p>\n<p>Explain the importance of demonstrating leadership and academic independence for aspiring faculty members.\nDiscuss the difficulties faced by graduate students in achieving this, including challenges in finding resources, gaining experience, and stepping out of their advisor's shadow.\nSection 2: The Role of Postdoctoral Researchers in Academia</p>\n<p>Describe the \"industry\" of postdoctoral researchers who move through term-limited positions until they secure a faculty position or leave the field.\nExplain the yearly job application process and the potential for rejection.\nSection 3: Types of Postdoctoral Positions: Soft Money and Fellowships</p>\n<p>Define soft money postdocs and their project-based nature, with limited time for personal research.\nContrast this with fellowships, which provide more resources and time for personal research, acting as \"little faculty launchpads.\"\nExplain the differences between institutional and national fellowships.\nSection 4: Distribution of National Fellowships: The Rich Get Richer?</p>\n<p>Introduce the research question: do national fellowships benefit less-wealthy institutions or do they concentrate resources at prestigious institutions?\nDiscuss the incentive for national fellowship money to be concentrated at wealthy institutions and the typical limit of one fellowship per institution.\nSection 5: Visualizing the Distribution of Fellowships</p>\n<p>Describe the data visualization process, including data collection, cleaning, and analysis.\nPresent visualizations that show the distribution of national fellowships across institutions, highlighting the concentration of resources at prestigious institutions.\nDiscuss any notable patterns or trends observed in the data.\nSection 6: Implications and Potential Solutions</p>\n<p>Analyze the implications of the current distribution of national fellowships in astronomy, particularly in relation to institutional inequality.\nDiscuss potential solutions for addressing this issue, such as reevaluating the allocation of national fellowships or implementing policies that promote equitable distribution of resources.\nEncourage readers to consider the broader implications of this issue in other fields and contexts.\nConclusion:\nSummarize the findings of the data visualization project and emphasize the importance of addressing institutional inequality in the distribution of national fellowships in astronomy. Encourage readers to advocate for more equitable resource allocation and consider the broader implications of this issue across academia.</p>","layout":"post","title":"National fellowships","date":"2023-02-01 00:00:00-06:00","img":"fellowship_bubble.png","tags":["dataviz","astronomy"]}},"__N_SSG":true}