{"pageProps":{"allPostsData":[{"id":"swd-nasa","layout":"post","title":"Storytelling with data at NASA's Earth Information Center","img":"swd_nasa.png","tags":["datasci","dataviz","talks"],"date":"2023-10-19 00:12:00-04:00","description":"Slides for my talk at the R Government conference on 10/19/2023.\nDon't let data speak for itself, it's our job as data scientists and visualizers to interpret the stories hidden in the data and convey them to stakeholders and decisionmakers.\n"},{"id":"eclipse-explorer","layout":"post","title":"2023 Eclipse Explorer: an interactive guide to the 2023 annular solar eclipse","img":"eclipse-explorer/eclipse-explorer-header.png","tags":["astronomy","dataviz"],"date":"2023-09-29 00:12:00-04:00","description":"The 2023 Eclipse Explorer is an interactive web map that allows users to track the annular solar eclipse that occurred on 10/14/2023 over the United States.\n"},{"id":"mentorship-network","layout":"post","title":"Using graph theory to benefit mentorship: a case study on using data science to impact department climate","date":"2023-07-30 10:00:00-06:00","description":"As one of the leaders of my department's Mentorship Action Team I designed and implemented a framework using network graph theory for optimizing mentor-mentee assignments into a complex hierarchical social network.","img":"mentorship/mentorship.png","tags":["dataviz","datasci"]},{"id":"firefly-gaia-dr3","layout":"post","title":"Exploring Gaia DR3 with Firefly","date":"2023-03-16 01:00:00-06:00","description":"I designed a massively parallel algorithm and progressive rendering scheme in order to interactively visualize all 1.5 billion+ stars observed by the Gaia satellite.","img":"firefly/gaia_lane.png","tags":["dataviz","astronomy"]},{"id":"firefly","layout":"post","title":"Firefly: an interactive dataviz software for millions of datapoints","date":"2023-03-16 00:00:00-06:00","description":"Firefly is a cutting-edge 3D browser-based, interactive, data visualization software designed for tens of millions of datapoints.\n","img":"four_view_banner.png","tags":["dataviz","software"]},{"id":"FIRE-studio","layout":"post","title":"FIRE Studio","img":"firestudio.png","tags":["astronomy","dataviz","software"],"date":"2022","description":"FIRE studio is a visualization package I created to streamline the process of producing publication-quality images of galaxy formation simulation data. \n"},{"id":"wind-chimes","layout":"post","title":"GPU-accelerated chemistry and numerical integration with WIND","img":"chimes_network.png","tags":["software","astronomy"],"date":"2019","description":"WIND is a CUDA library I built to numerically integrate stiff systems of coupled ODEs-- in particular interstellar chemical abundance networks.\n"},{"id":"supernova-clustering","layout":"post","title":"A statistical approach to studying stellar feedback","date":"2017","description":"As part of a class project I built a statistical model to understand and simplify our the results of our supercomputer simulation and apply them in other contexts at less (computational) cost.","img":"clustering_diagram.png","tags":["datasci","astronomy"]},{"id":"stellar-feedback","layout":"post","title":"What is stellar feedback and why should we care?","date":"2017","description":"Everyone knows about the sun, fewer people know where it came from and how other stars might've influenced its formation.   [pictured: M104, the Sombrero Galaxy (p.c. NASA/HST)] ","img":"sombrero-galaxy.jpeg","tags":["astronomy"]}]},"__N_SSG":true}