{"pageProps":{"postData":{"id":"stellar-feedback","contentHtml":"<p>Most people know about the Sun.\nIt's that big bright yellow thing in the sky that keeps us warm and ocassionally, gives us cancer.\nA lot of people, though I'm less confident about <em>most</em>, know the Sun is just one of many stars in our galaxy (which is, itself, one of many galaxies in our universe).\nEven fewer think about how stars and galaxies formed (a certainly true statement if we exclude those late night conversations inspired by too much of something).\nA tiny fraction of those know about the importance of something called \"stellar feedback\" (which I'll define momentarily) to galaxy and star formation and I'd say no one really <em>understands</em> it (and I should know, I have a Ph.D. on the impact of stellar feedback on star and galaxy formation).\nSo that's what I'll talk about here.</p>\n<figure class=\"right-figure\"> \n    <a href=\"https://en.wikipedia.org/wiki/Orion_Nebula#/media/File:Orion_Nebula_-_Hubble_2006_mosaic_18000.jpg\" target=\"_blank\"> \n        <img src=\"images/orion_hubble.jpeg\"/> \n    </a>\n    <caption> \n        [pictured: Orion Nebula as observed by the Hubble Space Telescope]\n        The interstellar medium is mostly made out of Hydrogen gas, but when clouds form the trace amounts of other elements (like Carbon and Oxygen) can combine to form organic compounds. \n        Like Alcohol! \n        Sagittarius B2 is a molecular cloud that has alcohol mixed with the chemical that gives raspberries their smell and taste.\n        Yes, indeed, Smirnoff beat us to it. \n        It's a cloud of raspberry vodka.\n        <a href=\"https://en.wikipedia.org/wiki/Sagittarius_B2\" target=\"_blank\">(source)</a>\n    </caption>\n</figure>\n<p>Stars form out of gas in the interstellar medium (\"inter-\": between, \"-stellar\": stars, \"medium\" stuff-- i.e. the stuff between stars).\nThis gas is mostly pure Hydrogen, i.e. <em>rocket fuel</em>.\nStars form a lot like raindrops do, they condense out of clouds when the temperature gets too cold.\nThe \"only\" difference is that when a star forms it's because gravity crunches the Hydrogen cloud down to such high densities that it forces the atoms to fuse together and become Helium.\nThe energy released by this nuclear fusion is what powers the Sun by heating up the plasma inside the Sun and preventing it from collapsing any further into a black hole (at least until it runs out of fuel, more on that in a second).\nBut the Sun can't contain <em>all</em> the energy, some of it escapes.\nIt spits some of the energy back out in the form of sunlight (radiation) made up of visual light (what we see), infrared light (the heat we feel), and UV light (the stuff that gives us cancer).\nThat radiation is just one way that stars <em>return energy into their environments</em>.</p>\n<p>Now, stars live a long time.\nThe Sun has been around for ~4.5 billion years should still be kicking for at least another 4 billion.\nBut stars that are bigger than the sun require more energy to prevent themselves from collapsing into a black hole and so use up their fuel a lot faster.\nThe biggest stars live only ~5 <em>million</em> years which is still a pretty long time, I'll admit, but short in the scheme of the universe.</p>\n<p>Those stars collapse into black holes and go <em>supernova</em> after burning their fuel.\nSupernovae are some of the universe's biggest explosions-- some supernovae can even be bright enough to outshine the other 10 billion stars in their galaxy.\nThe blast wave from these explosions can stir up the interstellar medium and prevent new clouds from forming.\nThis is what we mean when we say \"stellar feedback--\" it's a way for stars to put energy back into their environments to (temporarily) prevent new stars from forming.\nThis feedback loop self-regulates so that the star formation rate is a nice steady value.\nExcept when it doesn't, and the star formation rate becomes bursty!\nBut that's a story for another time (and the subject of my Ph.D. thesis).</p>","layout":"post","title":"What is stellar feedback and why should we care?","date":"2017","description":"Everyone knows about the sun, fewer people know where it came from and how other stars might've influenced its formation.   [pictured: M104, the Sombrero Galaxy (p.c. NASA/HST)] ","img":"sombrero-galaxy.jpeg","tags":["astronomy"]}},"__N_SSG":true}